{
  "FULL STACK": "مطور برامج",
  "Raafat Kamel": "رأفت كامل",
  "TECHNOLOGIES": "التقنيات",
  "CONTACT": "الإتصال",
  "PORTFOLIO": "معرض الأعمال",
  "SERVICE": "الخدمات",
  "DEVELOPER": "",
  "i am Raafat - a Full-Stack and GIS Developer": "أنا رأفت كامل مطور متكامل (Full-Stack)",
  "with a passion for creating impactful and efficient solutions.": "ومتخصص في نظم المعلومات الجغرافية (GIS) يتمتع بشغف بابتكار حلول فعّالة وذات تأثير.",
  "VIEW MY WORK": "شاهد أعمالى",
  "MY SERVICES": "الخدمات المقدمة",
  "Frontend Developer": "مطور الواجهة الأمامية",
  "I build high-performance web apps using Angular with responsive designs that work seamlessly on any device. From landing pages to complex web apps, I bring your ideas to life.": "أبني تطبيقات ويب عالية الأداء باستخدام Angular مع تصميمات متجاوبة تعمل بسلاسة على جميع الأجهزة. من الصفحات التعريفية إلى التطبيقات المعقدة، أحول أفكارك إلى واقع.",
  "Backend Developer": "مطور الواجهة الخلفية",
  "I develop scalable and efficient backends for web applications, ensuring robust performance and seamless integration with your frontend and database systems.": "أطوّر أنظمة خلفية قابلة للتوسع وفعالة لتطبيقات الويب، لضمان أداء قوي وتكامل سلس مع الواجهة الأمامية وأنظمة قواعد البيانات.",
  "GIS Developer & Expert": "مطور وخبير نظم المعلومات الجغرافية",
  "I specialize in GIS web apps, improving existing systems, and creating Python GIS tools with ArcPy to provide tailored geospatial solutions.": "متخصص في تطبيقات نظم المعلومات الجغرافية عبر الويب، وتحسين الأنظمة الحالية، وإنشاء أدوات GIS باستخدام Python وArcPy لتقديم حلول مكانية مخصصة.",
  "SKILLS": "المهارات",
  "The skills, tools and technologies i use :": "المهارات والأدوات والتقنيات التي أستخدمها:",
  "Web Apps": "مشاريع الويب",
  "Python": "بايثون",
  "ARCGIS": "نظم المعلومات الجغرافية",
  "Mobile Apps": "تطبيقات الهاتف",
  "Contact Me": "تواصل معى",
  "RK Maps is a powerful web and mobile application for uploading urban data, creating interactive maps online, and offering advanced features like AI-driven building detection and real-time chat.": "RK Maps هو تطبيق قوي للويب والجوال يتيح تحميل البيانات العمرانية، وإنشاء خرائط تفاعلية عبر الإنترنت، ويقدم ميزات متقدمة مثل اكتشاف المباني باستخدام الذكاء الاصطناعي والدردشة الفورية.",
  "A web app for managing and visualizing geospatial data, built with React, Framer Motion, Node.js, Express, and MongoDB. It features a smooth, animated interface for an immersive user experience.": "تطبيق ويب لإدارة وعرض البيانات الجغرافية المكانية، تم بناؤه باستخدام React وFramer Motion وNode.js وExpress وMongoDB. يتميز بواجهة سلسة ومتحركة توفر تجربة مستخدم غامرة.",
  "A 3D interactive portfolio built with React and Framer Motion, showcasing projects and skills through smooth animations and an immersive user experience.": "محفظة تفاعلية ثلاثية الأبعاد تم تطويرها باستخدام React وFramer Motion، تعرض المشاريع والمهارات من خلال حركات سلسة وتجربة مستخدم غامرة.",
  "Sallat Al-Mona is a dedicated online platform for selling Kuwaiti food products, offering a seamless shopping experience with authentic local flavors.": "سلة المنى هي منصة إلكترونية مخصصة لبيع المنتجات الغذائية الكويتية، وتوفر تجربة تسوق سلسة بنكهات محلية أصيلة.",
  "A web-based cabin booking and management system for a hotel, where staff can track available cabins and manage reservations through an interactive map and custom-built widgets.": "نظام حجز وإدارة الكبائن عبر الويب لفندق، حيث يمكن للموظفين تتبع الكبائن المتوفرة وإدارة الحجوزات من خلال خريطة تفاعلية وعناصر مخصصة.",
  "Real Estate is a web platform for managing properties, showcasing listings with map integrations and advanced search features.": "منصة إلكترونية لإدارة العقارات، تعرض الإعلانات العقارية مع تكامل الخرائط وميزات بحث متقدمة.",
  "Natours is a backend-powered travel booking platform built with Node.js, MongoDB, Express.js, and Pug.js, featuring secure payment options and seamless user experience.": "Natours هو نظام حجز سفر مدعوم بالخادم تم تطويره باستخدام Node.js وMongoDB وExpress.js وPug.js، ويتميز بخيارات دفع آمنة وتجربة مستخدم سلسة.",
  "Rentize is a real estate platform showcasing apartments for sale and rent, with features to display listings on a map and view nearby requests.": "Rentize هي منصة عقارية لعرض الشقق للبيع والإيجار، مزودة بميزات لعرض الإعلانات على الخريطة ومعاينة الطلبات القريبة.",
  "Market API is a web platform utilizing ESRI APIs to locate branches, find the nearest routes, define service areas, and provide interactive dashboards.": "Market API هي منصة ويب تستخدم واجهات ESRI البرمجية لتحديد مواقع الفروع، والعثور على أقرب الطرق، وتحديد مناطق الخدمة، وتوفير لوحات معلومات تفاعلية.",
  "This web project features a model for counting vehicles and calculating their speeds, all accessible online. Unlike desktop versions limited to users with the code and technical knowledge, this web-based solution allows anyone to upload and analyze their data easily.": "يتميز هذا المشروع بوجود نموذج لحساب عدد المركبات وسرعتها، وكل ذلك عبر الإنترنت. بخلاف الإصدارات المكتبية التي تتطلب معرفة تقنية، يتيح هذا الحل عبر الويب لأي شخص رفع بياناته وتحليلها بسهولة.",
  "A React-based web GIS application using ArcGIS API and ArcGIS Online, featuring custom widgets to display and share specific map layers with clients.": "تطبيق ويب لنظم المعلومات الجغرافية تم تطويره باستخدام React وواجهة ArcGIS API وArcGIS Online، ويتميز بعناصر مخصصة لعرض طبقات الخريطة ومشاركتها مع العملاء.",
  "Moon is an online platform specializing in selling stylish and high-quality clothing, offering a seamless shopping experience for all.": "Moon هي منصة إلكترونية متخصصة في بيع الملابس الأنيقة وعالية الجودة، وتوفر تجربة تسوق سلسة للجميع.",

  "This project uses Python and the OpenPyXL library to convert multiple Excel data sets into charts, automating the process of visualizing data within Excel for improved analysis and reporting.": "يستخدم هذا المشروع بايثون ومكتبة OpenPyXL لتحويل مجموعات بيانات Excel متعددة إلى مخططات، مما يسهل عملية تصور البيانات داخل Excel لتحليل وتقارير أفضل.",

  "Introducing \"Databases Collecting,\" a powerful tool for merging multiple databases into a single one, regardless of the number of features, with remarkable speed and efficiency.": "نقدم أداة \"جمع قواعد البيانات\"، وهي أداة قوية لدمج قواعد بيانات متعددة في قاعدة واحدة، بغض النظر عن عدد الخصائص، بسرعة وكفاءة مذهلة.",

  "Introducing \"Topology,\" a unique tool that enables self-clipping between features, a functionality not available in GIS. With a touch of AI, it not only identifies intersections but resolves them, offering a groundbreaking solution for topology management in GIS.": "نقدم أداة \"الطوبولوجيا\"، وهي أداة فريدة تتيح القطع الذاتي بين المعالم، وهي وظيفة غير متوفرة في نظم المعلومات الجغرافية. مع لمسة من الذكاء الاصطناعي، لا تكتشف التقاطعات فقط بل تقوم بحلها أيضاً، مما يوفر حلاً مبتكرًا لإدارة الطوبولوجيا.",

  "This tool takes the path of a folder containing multiple KML files and aggregates them into a single SHP file, streamlining the conversion process for large datasets.": "تقوم هذه الأداة بأخذ مسار مجلد يحتوي على ملفات KML متعددة وتدمجها في ملف SHP واحد، مما يبسط عملية التحويل لمجموعات البيانات الكبيرة.",

  "This new ArcGIS tool integrates ArcPy with libraries like Exif, re, and OpenPyxl, enabling advanced analyses beyond traditional GIS capabilities. It bridges specialized external libraries with GIS to perform unique computations and seamlessly visualize results in ArcGIS. The tools first phase uses Python scripts to process data, later uploading points and associated images to ArcGIS Online for easy sharing and exploration.": "تدمج هذه الأداة ArcPy مع مكتبات مثل Exif و re و OpenPyxl، مما يتيح إجراء تحليلات متقدمة خارج نطاق نظم المعلومات الجغرافية التقليدية. تبدأ الأداة بمعالجة البيانات باستخدام سكريبتات بايثون، ثم تحميل النقاط والصور المرتبطة إلى ArcGIS Online لسهولة المشاركة والاستكشاف.",

  "Introducing a transformative tool that converts data from Orbits schema to the official Saudi Ministry of Planning schema on GIS, reducing a 1.5-day workload to just 3 minutes.": "نقدم أداة تحويل ثورية تقوم بتحويل البيانات من تنسيق Orbit إلى تنسيق وزارة التخطيط السعودية الرسمي في نظم المعلومات الجغرافية، مما يقلل من عبء العمل الذي يستغرق يومًا ونصف إلى ثلاث دقائق فقط.",
  "2025-All rights reserved, web development-Raafat Kamel": "2025 - جميع الحقوق محفوظة , تطوير الموقع بواسطة رأفت كامل"
}
